Revit 2024 API
GeometryElement.GetEnumeratorNG Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
internal IEnumerator GetEnumeratorNG()
Visual Basic
Friend Function GetEnumeratorNG As IEnumerator
Visual C++
internal:
virtual IEnumerator^ GetEnumeratorNG() sealed
Return Value
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.
Implements
IEnumerable.GetEnumerator()
See Also
GeometryElement Class
Autodesk.Revit.DB Namespace